In [6]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\skme2\anaconda3\lib\site-packages (1.22.4)

WARNING: Ignoring invalid distribution -atplotlib (c:\users\skme2\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -atplotlib (c:\users\skme2\anaconda3\lib\site-packages)

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [7]:
import numpy as np

C:\Users\skme2\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\skme2\anaconda3\lib\site-packages\numpy\.libs\libopenblas.EL2C6PLE4ZYW3ECEVIV3OXXGRN2NRFM2.gfortran-win_amd64.dll
C:\Users\skme2\anaconda3\lib\site-packages\numpy\.libs\libopenblas.FB5AE2TYXYH2IJRDKGDGQ3XBKLKTF43H.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

In [8]:
lst = [5,7,9,10,15,16,17]

In [9]:
s = []
for i in lst:
    s.append(i+1)

In [10]:
s

[6, 8, 10, 11, 16, 17, 18]

In [13]:
%timeit [i**2 for i in lst]

1.42 µs ± 113 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

In [15]:
arr = np.array(lst)

In [16]:
arr+1

array([ 6,  8, 10, 11, 16, 17, 18])

In [18]:
%timeit (arr**2)

487 ns ± 77.5 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

In [19]:
lst + 5

TypeError: can only concatenate list (not "int") to list

In [20]:
lst + [5]

[5, 7, 9, 10, 15, 16, 17, 5]

In [21]:
arr + 5

array([10, 12, 14, 15, 20, 21, 22])

In [23]:
set(range(1,10))

{1, 2, 3, 4, 5, 6, 7, 8, 9}

In [26]:
arr1 = np.arange(1,31,5)

In [27]:
lst = [1,5,8,9,10,15,16]

In [29]:
arr2 = np.array(lst)

In [30]:
arr2.shape

(7,)

In [31]:
arr2.ndim

1

In [32]:
type(arr2)

numpy.ndarray

In [34]:
tuple(range(1,21))

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)

In [36]:
new_arr = np.arange(1,21,3)

In [37]:
new_arr

array([ 1,  4,  7, 10, 13, 16, 19])

In [39]:
new_arr3 = np.arange(3,21,3)

In [40]:
new_arr3

array([ 3,  6,  9, 12, 15, 18])

In [41]:
lst_2d = [[1,2,3], [4,5,6], [7,8,9], [10,11,12]]

In [42]:
lst_2d

[[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]]

In [44]:
arr4 = np.array(lst_2d)

In [45]:
arr4

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [46]:
arr4.shape

(4, 3)

In [47]:
arr4.ndim

2

In [48]:
arr4.nbytes

48

In [49]:
type(arr4)

numpy.ndarray

In [50]:
np.zeros(5)

array([0., 0., 0., 0., 0.])

In [52]:
np.zeros((5,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [53]:
np.zeros([5,5])

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [55]:
np.ones(9)

array([1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [56]:
np.ones((9,9))

array([[1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [58]:
np.ones([5,5])

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [60]:
np.diag([8])

array([[8]])

In [61]:
np.diag([1,2,3])

array([[1, 0, 0],
       [0, 2, 0],
       [0, 0, 3]])

In [64]:
np.diag((7,5,3))

array([[7, 0, 0],
       [0, 5, 0],
       [0, 0, 3]])

In [65]:
np.identity(9)

array([[1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1.]])

In [66]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [67]:
np.random.randint(10,100)

76

In [69]:
new_arr = np.random.randint(1,100, (8,6))

In [70]:
new_arr.shape

(8, 6)

In [71]:
type(new_arr)

numpy.ndarray

In [72]:
print(new_arr)

[[ 7 27 29 66 97  4]
 [65 40 13  4 29 14]
 [58 75 17 20 81 44]
 [44 98 85 89 27 93]
 [76 12 11 49 30 80]
 [32 73 34 64 58 52]
 [57 39 37 57 31 62]
 [97 96 77 14 16 45]]

In [73]:
new_arr[0]

array([ 7, 27, 29, 66, 97,  4])

In [74]:
new_arr[1]

array([65, 40, 13,  4, 29, 14])

In [75]:
new_arr[5]

array([32, 73, 34, 64, 58, 52])

In [76]:
new_arr[-1]

array([97, 96, 77, 14, 16, 45])

In [77]:
new_arr[-2]

array([57, 39, 37, 57, 31, 62])

In [78]:
new_arr

array([[ 7, 27, 29, 66, 97,  4],
       [65, 40, 13,  4, 29, 14],
       [58, 75, 17, 20, 81, 44],
       [44, 98, 85, 89, 27, 93],
       [76, 12, 11, 49, 30, 80],
       [32, 73, 34, 64, 58, 52],
       [57, 39, 37, 57, 31, 62],
       [97, 96, 77, 14, 16, 45]])

In [79]:
new_arr[:,0]

array([ 7, 65, 58, 44, 76, 32, 57, 97])

In [80]:
new_arr[:,1]

array([27, 40, 75, 98, 12, 73, 39, 96])

In [81]:
new_arr[:, -1]

array([ 4, 14, 44, 93, 80, 52, 62, 45])

In [82]:
new_arr[:,-2]

array([97, 29, 81, 27, 30, 58, 31, 16])

In [83]:
new_arr

array([[ 7, 27, 29, 66, 97,  4],
       [65, 40, 13,  4, 29, 14],
       [58, 75, 17, 20, 81, 44],
       [44, 98, 85, 89, 27, 93],
       [76, 12, 11, 49, 30, 80],
       [32, 73, 34, 64, 58, 52],
       [57, 39, 37, 57, 31, 62],
       [97, 96, 77, 14, 16, 45]])

In [85]:
new_arr[0,0]

7

In [87]:
new_arr[3,2]

85

In [89]:
new_arr[-1,-1]

45

In [92]:
new_arr[4:, 3:]

array([[49, 30, 80],
       [64, 58, 52],
       [57, 31, 62],
       [14, 16, 45]])

In [93]:
new_arr[:,2]

array([29, 13, 17, 85, 11, 34, 37, 77])

In [94]:
new_arr[:,-1]

array([ 4, 14, 44, 93, 80, 52, 62, 45])

In [98]:
new_arr[0,0] = 0

In [99]:
new_arr

array([[ 0, 27, 29, 66, 97,  4],
       [65, 40, 13,  4, 29, 14],
       [58, 75, 17, 20, 81, 44],
       [44, 98, 85, 89, 27, 93],
       [76, 12, 11, 49, 30, 80],
       [32, 73, 34, 64, 58, 52],
       [57, 39, 37, 57, 31, 62],
       [97, 96, 77, 14, 16, 45]])

In [100]:
# masking

In [102]:
new_arr[new_arr>10]

array([27, 29, 66, 97, 65, 40, 13, 29, 14, 58, 75, 17, 20, 81, 44, 44, 98,
       85, 89, 27, 93, 76, 12, 11, 49, 30, 80, 32, 73, 34, 64, 58, 52, 57,
       39, 37, 57, 31, 62, 97, 96, 77, 14, 16, 45])

In [104]:
mask = new_arr>50

In [105]:
print(mask)

[[False False False  True  True False]
 [ True False False False False False]
 [ True  True False False  True False]
 [False  True  True  True False  True]
 [ True False False False False  True]
 [False  True False  True  True  True]
 [ True False False  True False  True]
 [ True  True  True False False False]]

In [107]:
np.sum(new_arr>50)

22

In [109]:
new_arr[new_arr>50]

array([66, 97, 65, 58, 75, 81, 98, 85, 89, 93, 76, 80, 73, 64, 58, 52, 57,
       57, 62, 97, 96, 77])

In [114]:
new_arr[-2:, -2:] = 0

In [115]:
new_arr

array([[ 0, 27, 29, 66, 97,  4],
       [65, 40, 13,  4, 29, 14],
       [58, 75, 17, 20, 81, 44],
       [44, 98, 85, 89, 27, 93],
       [76, 12, 11, 49, 30, 80],
       [32, 73, 34, 64, 58, 52],
       [57, 39, 37, 57,  0,  0],
       [97, 96, 77, 14,  0,  0]])

In [116]:
# Basic opeartions in array

In [117]:
a = np.array([10,20,30,40])

In [119]:
b = np.arange(1,5)

In [120]:
a

array([10, 20, 30, 40])

In [121]:

b

array([1, 2, 3, 4])

In [122]:
a+b

array([11, 22, 33, 44])

In [123]:
a-b

array([ 9, 18, 27, 36])

In [124]:
a*b

array([ 10,  40,  90, 160])

In [125]:
a/b

array([10., 10., 10., 10.])

In [126]:
a%b

array([0, 0, 0, 0])

In [127]:
b**2

array([ 1,  4,  9, 16])

In [129]:
np.sum(a>15)

3

In [130]:
np.log(a)

array([2.30258509, 2.99573227, 3.40119738, 3.68887945])

In [131]:
np.sin(b)

array([ 0.84147098,  0.90929743,  0.14112001, -0.7568025 ])

In [132]:
A = np.random.randint(1,100,(4,3))

In [133]:
B  =np.random.randint(15,150,(3,5))

In [134]:
np.dot(A,B)

array([[15495, 16344, 16584, 12168, 12359],
       [15818, 15916, 17388, 12236, 12574],
       [22238, 20344, 21666, 14552, 16867],
       [ 8230,  6750,  7390,  4606,  6008]])

In [135]:
# More operations on Arrays

In [136]:
arr = np.arange(0,24)

In [137]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23])

In [139]:
A = arr.reshape(6,4)

In [140]:
A

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [141]:
np.sqrt(A)

array([[0.        , 1.        , 1.41421356, 1.73205081],
       [2.        , 2.23606798, 2.44948974, 2.64575131],
       [2.82842712, 3.        , 3.16227766, 3.31662479],
       [3.46410162, 3.60555128, 3.74165739, 3.87298335],
       [4.        , 4.12310563, 4.24264069, 4.35889894],
       [4.47213595, 4.58257569, 4.69041576, 4.79583152]])

In [143]:
np.sum(A)

276

In [144]:
A

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [145]:
np.sum(A, axis=0)

array([60, 66, 72, 78])

In [146]:
np.sum(A, axis=1)

array([ 6, 22, 38, 54, 70, 86])

In [147]:
np.mean(A)

11.5

In [148]:
np.mean(A, axis=0)

array([10., 11., 12., 13.])

In [149]:
np.mean(A, axis=1)

array([ 1.5,  5.5,  9.5, 13.5, 17.5, 21.5])

In [150]:
np.max(A)

23

In [151]:
np.max(A, axis=0)

array([20, 21, 22, 23])

In [152]:
np.min(A, axis=1)

array([ 0,  4,  8, 12, 16, 20])

In [155]:
np.round(np.std(A), 2)

6.92

In [156]:
A

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [158]:
A = A.reshape(8,3)

In [159]:
A.flatten()

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23])

In [160]:
A

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14],
       [15, 16, 17],
       [18, 19, 20],
       [21, 22, 23]])

In [161]:
A.T

array([[ 0,  3,  6,  9, 12, 15, 18, 21],
       [ 1,  4,  7, 10, 13, 16, 19, 22],
       [ 2,  5,  8, 11, 14, 17, 20, 23]])

In [162]:
A

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14],
       [15, 16, 17],
       [18, 19, 20],
       [21, 22, 23]])

In [163]:
np.transpose(A)

array([[ 0,  3,  6,  9, 12, 15, 18, 21],
       [ 1,  4,  7, 10, 13, 16, 19, 22],
       [ 2,  5,  8, 11, 14, 17, 20, 23]])

In [164]:
# staccking

In [166]:
d =np.random.randint(1,500,(3,3))

In [168]:
w = np.random.randint(500,2000,(3,3))

In [169]:
w

array([[1764, 1533, 1725],
       [1040,  822, 1979],
       [ 776,  617, 1023]])

In [170]:
d

array([[425, 322, 101],
       [310, 349, 321],
       [410,  55, 405]])

In [171]:
np.vstack((w,d))

array([[1764, 1533, 1725],
       [1040,  822, 1979],
       [ 776,  617, 1023],
       [ 425,  322,  101],
       [ 310,  349,  321],
       [ 410,   55,  405]])

In [172]:
np.hstack((d,w))

array([[ 425,  322,  101, 1764, 1533, 1725],
       [ 310,  349,  321, 1040,  822, 1979],
       [ 410,   55,  405,  776,  617, 1023]])

In [173]:
a = np.random.randint(1,10,(3,3))

In [174]:
b = np.array([1,2,3])

In [175]:
a

array([[7, 9, 7],
       [3, 1, 4],
       [7, 2, 5]])

In [176]:
b

array([1, 2, 3])

In [177]:
a + b

array([[ 8, 11, 10],
       [ 4,  3,  7],
       [ 8,  4,  8]])

In [178]:
a.T

array([[7, 3, 7],
       [9, 1, 2],
       [7, 4, 5]])

In [179]:
a + a.T

array([[14, 12, 14],
       [12,  2,  6],
       [14,  6, 10]])

In [180]:
a

array([[7, 9, 7],
       [3, 1, 4],
       [7, 2, 5]])

In [181]:
a + 8

array([[15, 17, 15],
       [11,  9, 12],
       [15, 10, 13]])

In [205]:
p1 = np.random.randint(1,100,(8))

In [206]:
p2 = np.array([5,5,8,2,-9,2,1,6])

In [207]:
def distance(p1,p2):
    return np.sqrt(np.sum((p2-p1)**2))

In [208]:
distance(p1,p2)

129.73819792181484

In [192]:
p1

array([40, 14, 61, 83, 28, 93, 59, 81])

In [193]:
p2

array([ 5,  5,  8,  2, -9,  2,  1,  6])

In [209]:
sum__ = 0
for i in range(len(p1)):
    sum__+=(p2[i]-p1[i])**2

In [210]:
sum__

16832

In [211]:
sum__**0.5

129.73819792181484

In [212]:
p1 = np.array([1,2, 4, 7, -2, 9, 6, 0])
p2 = np.array([5,5, 8, 2, -9, 2, 1, 6])

In [213]:
distance(p1,p2)

15.0

In [214]:
sum__ = 0
for i in range(len(p1)):
    sum__+=(p2[i]-p1[i])**2

In [215]:
sum__

225

In [216]:
sum__**0.5

15.0

In [217]:
# Pandas

In [218]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\skme2\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\skme2\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\skme2\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\skme2\anaconda3\lib\site-packages (from pandas) (1.22.4)
Requirement already satisfied: six>=1.5 in c:\users\skme2\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: Ignoring invalid distribution -atplotlib (c:\users\skme2\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -atplotlib (c:\users\skme2\anaconda3\lib\site-packages)

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [219]:
import pandas as pd

In [220]:
lst = ['c', 'c++', 'python', 'java', 'HTML']

In [222]:
book_title = pd.Series(lst)

In [223]:
book_title

0         c
1       c++
2    python
3      java
4      HTML
dtype: object

In [224]:
type(book_title)

pandas.core.series.Series

In [225]:
book_title[0]

'c'

In [227]:
book_title[3]

'java'

In [228]:
book_title[1]

'c++'

In [231]:
book_title.index = ['a', 'b', 'c', 'd', 'e']

In [232]:
book_title

a         c
b       c++
c    python
d      java
e      HTML
dtype: object

In [234]:
book_title[2]

'python'

In [235]:
book_title['c']

'python'

In [236]:
import numpy as np

In [238]:
arr = np.random.randint(10,100, size = (8,6))

In [242]:
df = pd.DataFrame(data=arr)

In [243]:
df

    0   1   2   3   4   5
0  64  44  51  97  14  74
1  27  58  16  56  81  18
2  71  84  65  77  66  73
3  22  69  46  32  82  82
4  72  86  99  77  26  69
5  35  47  21  28  27  93
6  11  25  53  71  56  21
7  57  75  19  52  63  28

In [244]:
type(df)

pandas.core.frame.DataFrame

In [246]:
df[0]

0    64
1    27
2    71
3    22
4    72
5    35
6    11
7    57
Name: 0, dtype: int32

In [248]:
df[2]

0    51
1    16
2    65
3    46
4    99
5    21
6    53
7    19
Name: 2, dtype: int32

In [252]:
type(df[5])

pandas.core.series.Series

In [255]:
df.columns = ['A','B', 'C', 'D', 'E','F']

In [256]:
df

    A   B   C   D   E   F
0  64  44  51  97  14  74
1  27  58  16  56  81  18
2  71  84  65  77  66  73
3  22  69  46  32  82  82
4  72  86  99  77  26  69
5  35  47  21  28  27  93
6  11  25  53  71  56  21
7  57  75  19  52  63  28

In [257]:
df['A']

0    64
1    27
2    71
3    22
4    72
5    35
6    11
7    57
Name: A, dtype: int32

In [258]:
df['C']

0    51
1    16
2    65
3    46
4    99
5    21
6    53
7    19
Name: C, dtype: int32

In [259]:
df

    A   B   C   D   E   F
0  64  44  51  97  14  74
1  27  58  16  56  81  18
2  71  84  65  77  66  73
3  22  69  46  32  82  82
4  72  86  99  77  26  69
5  35  47  21  28  27  93
6  11  25  53  71  56  21
7  57  75  19  52  63  28

In [260]:
df.shape

(8, 6)

In [262]:
df.head(3)

    A   B   C   D   E   F
0  64  44  51  97  14  74
1  27  58  16  56  81  18
2  71  84  65  77  66  73

In [265]:
df.tail(2)

    A   B   C   D   E   F
6  11  25  53  71  56  21
7  57  75  19  52  63  28

In [269]:
df.sample(3)

    A   B   C   D   E   F
0  64  44  51  97  14  74
4  72  86  99  77  26  69
5  35  47  21  28  27  93

In [271]:
df['D']

0    97
1    56
2    77
3    32
4    77
5    28
6    71
7    52
Name: D, dtype: int32

In [275]:
df[['C', 'D']]

    C   D
0  51  97
1  16  56
2  65  77
3  46  32
4  99  77
5  21  28
6  53  71
7  19  52

In [277]:
df[['D', 'A','B']]

    D   A   B
0  97  64  44
1  56  27  58
2  77  71  84
3  32  22  69
4  77  72  86
5  28  35  47
6  71  11  25
7  52  57  75

In [279]:
df['A']

0    64
1    27
2    71
3    22
4    72
5    35
6    11
7    57
Name: A, dtype: int32

In [280]:
df['B']

0    44
1    58
2    84
3    69
4    86
5    47
6    25
7    75
Name: B, dtype: int32

In [282]:
df['A+B'] =  df['A'] + df['B']

In [283]:

df

    A   B   C   D   E   F  A+B
0  64  44  51  97  14  74  108
1  27  58  16  56  81  18   85
2  71  84  65  77  66  73  155
3  22  69  46  32  82  82   91
4  72  86  99  77  26  69  158
5  35  47  21  28  27  93   82
6  11  25  53  71  56  21   36
7  57  75  19  52  63  28  132

In [286]:
df['A*B'] =df['A'] *  df['B']

In [287]:
df

    A   B   C   D   E   F  A+B   A*B
0  64  44  51  97  14  74  108  2816
1  27  58  16  56  81  18   85  1566
2  71  84  65  77  66  73  155  5964
3  22  69  46  32  82  82   91  1518
4  72  86  99  77  26  69  158  6192
5  35  47  21  28  27  93   82  1645
6  11  25  53  71  56  21   36   275
7  57  75  19  52  63  28  132  4275

In [292]:
df.drop(labels='D', axis=1, inplace=True)

In [293]:
df

    A   B   C   E   F  A+B   A*B
0  64  44  51  14  74  108  2816
1  27  58  16  81  18   85  1566
2  71  84  65  66  73  155  5964
3  22  69  46  82  82   91  1518
4  72  86  99  26  69  158  6192
5  35  47  21  27  93   82  1645
6  11  25  53  56  21   36   275
7  57  75  19  63  28  132  4275

In [298]:
df.drop(columns=['A+B', 'A*B'])

    A   B   C   E   F
0  64  44  51  14  74
1  27  58  16  81  18
2  71  84  65  66  73
3  22  69  46  82  82
4  72  86  99  26  69
5  35  47  21  27  93
6  11  25  53  56  21
7  57  75  19  63  28

In [302]:
df.drop(index=[0,1])

    A   B   C   E   F  A+B   A*B
2  71  84  65  66  73  155  5964
3  22  69  46  82  82   91  1518
4  72  86  99  26  69  158  6192
5  35  47  21  27  93   82  1645
6  11  25  53  56  21   36   275
7  57  75  19  63  28  132  4275

In [305]:
df.drop(labels=[0,1])

    A   B   C   E   F  A+B   A*B
2  71  84  65  66  73  155  5964
3  22  69  46  82  82   91  1518
4  72  86  99  26  69  158  6192
5  35  47  21  27  93   82  1645
6  11  25  53  56  21   36   275
7  57  75  19  63  28  132  4275

In [308]:
df = df.drop(columns=['A+B', 'A*B'])

In [309]:
df

    A   B   C   E   F
0  64  44  51  14  74
1  27  58  16  81  18
2  71  84  65  66  73
3  22  69  46  82  82
4  72  86  99  26  69
5  35  47  21  27  93
6  11  25  53  56  21
7  57  75  19  63  28

In [312]:
df.index = 'p q r s t u v w'.split()

In [313]:
df

    A   B   C   E   F
p  64  44  51  14  74
q  27  58  16  81  18
r  71  84  65  66  73
s  22  69  46  82  82
t  72  86  99  26  69
u  35  47  21  27  93
v  11  25  53  56  21
w  57  75  19  63  28

In [315]:
df.loc['p']

A    64
B    44
C    51
E    14
F    74
Name: p, dtype: int32

In [318]:
df.iloc[0]

A    64
B    44
C    51
E    14
F    74
Name: p, dtype: int32

In [320]:
df.loc['q']

A    27
B    58
C    16
E    81
F    18
Name: q, dtype: int32

In [324]:
df.loc['s']

A    22
B    69
C    46
E    82
F    82
Name: s, dtype: int32

In [326]:
df.iloc[3]

A    22
B    69
C    46
E    82
F    82
Name: s, dtype: int32

In [328]:
df.loc['w']

A    57
B    75
C    19
E    63
F    28
Name: w, dtype: int32

In [329]:
df

    A   B   C   E   F
p  64  44  51  14  74
q  27  58  16  81  18
r  71  84  65  66  73
s  22  69  46  82  82
t  72  86  99  26  69
u  35  47  21  27  93
v  11  25  53  56  21
w  57  75  19  63  28

In [330]:
df.iloc[-1]

A    57
B    75
C    19
E    63
F    28
Name: w, dtype: int32

In [333]:
df.iloc[5:, 2:]

    C   E   F
u  21  27  93
v  53  56  21
w  19  63  28

In [339]:
df.iloc[-3:, -3:][['E', 'F']]

    E   F
u  27  93
v  56  21
w  63  28

In [344]:
df.iloc[-2:][['A', 'B']]

    A   B
v  11  25
w  57  75

In [348]:
df.iloc[-2:, -2:]

    E   F
v  56  21
w  63  28

In [349]:
# Masking - Boolean masking

In [352]:
df[df>15]

      A   B   C     E   F
p  64.0  44  51   NaN  74
q  27.0  58  16  81.0  18
r  71.0  84  65  66.0  73
s  22.0  69  46  82.0  82
t  72.0  86  99  26.0  69
u  35.0  47  21  27.0  93
v   NaN  25  53  56.0  21
w  57.0  75  19  63.0  28

In [355]:
df[df>30]

      A     B     C     E     F
p  64.0  44.0  51.0   NaN  74.0
q   NaN  58.0   NaN  81.0   NaN
r  71.0  84.0  65.0  66.0  73.0
s   NaN  69.0  46.0  82.0  82.0
t  72.0  86.0  99.0   NaN  69.0
u  35.0  47.0   NaN   NaN  93.0
v   NaN   NaN  53.0  56.0   NaN
w  57.0  75.0   NaN  63.0   NaN

In [362]:
df[df['B']>40][['B', 'C']]

    B   C
p  44  51
q  58  16
r  84  65
s  69  46
t  86  99
u  47  21
w  75  19

In [369]:
df[df['A']>40][['A','B']]

    A   B
p  64  44
r  71  84
t  72  86
w  57  75

In [373]:
df['C']

p    51
q    16
r    65
s    46
t    99
u    21
v    53
w    19
Name: C, dtype: int32

In [377]:
df[df.C<50]

    A   B   C   E   F
q  27  58  16  81  18
s  22  69  46  82  82
u  35  47  21  27  93
w  57  75  19  63  28

In [383]:
df[(df['A']>40) & (df['C']<50)]

    A   B   C   E   F
w  57  75  19  63  28

In [381]:
df['C']<50

p    False
q     True
r    False
s     True
t    False
u     True
v    False
w     True
Name: C, dtype: bool

In [385]:
df.values

array([[64, 44, 51, 14, 74],
       [27, 58, 16, 81, 18],
       [71, 84, 65, 66, 73],
       [22, 69, 46, 82, 82],
       [72, 86, 99, 26, 69],
       [35, 47, 21, 27, 93],
       [11, 25, 53, 56, 21],
       [57, 75, 19, 63, 28]])

In [386]:
# iris data

In [389]:
ls

 Volume in drive C is OS
 Volume Serial Number is 0CC1-C20F

 Directory of C:\Users\skme2\Downloads

14-09-2023  23:32    <DIR>          .
04-09-2023  00:15    <DIR>          ..
14-09-2023  21:43    <DIR>          .ipynb_checkpoints
02-11-2022  15:49           410,816 0211resume.pdf
03-09-2023  14:20            54,756 03_09_1_pm_Functions.ipynb
20-03-2023  16:51           118,844 04_06.ipynb
05-08-2023  17:33       144,122,096 05_08_1PM.zip
05-08-2023  17:32            28,266 05_08_firoj_tapan.ipynb
08-04-2023  17:46             6,413 08_04_2023_window functions__damini_04_06.sql
08-05-2023  17:43           453,229 08_05_power bi.pbix
08-11-2022  11:41           412,631 08novresume.pdf
09-04-2023  17:37             2,262 09_damini stored_processor.sql
08-10-2022  12:44               582 1.0.5
11-04-2023  14:25       279,467,547 10_04_2023.mp4
16-09-2022  19:48         7,070,153 100-Business-English-Expressions.pdf
23-09-2022  08:41         1,139,062 101-Essays-That-Will-Change-The-Way-You-Think_.pdf
03-01-2023  14:28    <DIR>          1071244354_9761672683050
03-01-2023  14:23            27,403 1071244354_9761672683050.rar
14-12-2022  23:53    <DIR>          1081876154_needhelp
14-12-2022  23:49        16,781,691 1081876154_needhelp.zip
03-04-2023  15:02    <DIR>          10thAprilDeploymentSteps-20230403T093128Z-001
09-06-2023  23:28    <DIR>          10thAprilDeploymentSteps-20230609T175740Z-001
09-06-2023  23:27         1,879,584 10thAprilDeploymentSteps-20230609T175740Z-001.zip
31-03-2023  17:05    <DIR>          10thOctBA-20230331T112251Z-001
02-05-2023  23:02    <DIR>          10thOctBA-20230502T173034Z-001
02-05-2023  23:00         4,290,115 10thOctBA-20230502T173034Z-001.zip
19-03-2023  14:58           136,129 11_03_2023_Saurabh .ipynb
01-04-2023  14:11             7,548 11_04_matplotlib.ipynb
04-07-2023  12:00            16,100 11AM_04_07.ipynb
07-01-2023  11:15           251,753 1215725943_2151672927494.rar
12-12-2022  21:33             3,972 1236247724_attach-file-1670846640142.zip
03-01-2023  15:27            94,784 1257579810_9101672689580.xlsx
03-01-2023  15:27            94,784 1277482325_7351672689456.xlsx
05-03-2023  17:24    <DIR>          12thSep-20230305T115045Z-001
05-03-2023  17:21         1,800,263 12thSep-20230305T115045Z-001.zip
03-01-2023  15:27            94,784 132808084_2671672689536.xlsx
03-01-2023  15:29            68,516 1346113162_attach-file-1672689878840.xlsx
14-03-2023  09:44                63 14_textfile.txt
06-01-2023  08:59         4,894,621 1472359526_2145622_1839731_6302138.docx.pdf
07-01-2023  11:15            40,869 1622747648_4091673022377.PNG
16-06-2022  12:41           821,305 1655303783088.pdf
16-06-2022  12:42           805,584 1655361164152.pdf
24-06-2022  11:57         1,554,236 1655729738530.pdf
22-06-2022  11:00         2,858,697 1655808683836.pdf
22-06-2022  10:01           474,528 1655817362570.pdf
31-07-2022  23:27           194,662 1659268223394.pdf
01-08-2022  12:03           202,563 1659327300591.pdf
19-08-2022  11:56            95,777 1660554784534.pdf
31-08-2022  14:56            76,256 1660633425891.pdf
20-08-2022  13:03           278,174 1660706504763.pdf
18-08-2022  12:25         2,285,675 1660796239124.pdf
20-08-2022  13:03           290,834 1660964997593.pdf
28-08-2022  23:57            84,072 1661491570743.pdf
03-09-2022  11:57        24,347,918 1662176194924.pdf
11-09-2022  19:15         3,089,241 1662895783938.pdf
16-10-2022  19:04            25,278 1665927254292T5LGVZEqHRtY18DM.pdf
02-11-2022  15:29         1,348,909 1667367903949.pdf
24-03-2023  20:17           346,341 1679666303576.pdf
24-11-2022  10:04           245,499 1733335575_2126730_1816551_6245808.docx.pdf
08-10-2022  23:14    <DIR>          18.3.Plotly.7z (Unzipped Files)-20221008T174315Z-001
08-10-2022  23:13         4,688,447 18.3.Plotly.7z (Unzipped Files)-20221008T174315Z-001.zip
10-10-2022  16:40         2,879,041 18_4_Cufflinks_checkpoint.ipynb
24-11-2022  15:10           243,853 1813334027_2126730_1817076_6247183.docx.pdf
07-01-2023  12:30         4,890,890 1835446948_Updated_solution_06012023.docx.pdf
03-01-2023  14:32    <DIR>          1867855190_9251672678839
03-01-2023  14:23            47,736 1867855190_9251672678839.rar
03-01-2023  15:24            17,779 1900425184_attach-file-16726896538021.docx
03-01-2023  15:27            94,784 1925709743_4951672689567.xlsx
07-01-2023  16:26            30,201 1964090971_attach-file-1672220444499.docx
03-01-2023  15:29            63,488 1976883288_attach-file-1672689879136.doc
29-09-2022  05:57         5,227,782 1-deep learning (1).pdf
18-08-2022  17:45         5,227,782 1-deep learning.pdf
19-07-2022  21:09         5,812,051 1-Simple Linearregression.pdf
07-10-2022  21:35           694,907 1st Oct Data Science industry(3-Git ).pdf
10-03-2023  16:06        26,300,953 1st Oct FSDA-20230310T103630Z-001.zip
08-01-2023  13:06            31,186 2009659.docx
03-01-2023  14:23            41,767 2049695533_1501672678817.PNG
03-01-2023  20:53         2,991,850 2050840287_6571672736572.rar
30-11-2022  10:51    <DIR>          2057936858_1521669747194
25-11-2022  20:59           282,615 2064437649_6111669265346 (1).xlsx
25-11-2022  12:53           282,615 2064437649_6111669265346.xlsx
21-03-2023  13:56             5,943 21_03_ruda_utkarsh.sql
26-11-2022  17:43           207,304 2119999.zip
24-11-2022  10:30    <DIR>          2126730
16-09-2022  19:46         1,477,146 2127.pdf
26-11-2022  17:34    <DIR>          2127053
26-11-2022  17:25        10,955,424 2127053 (2).zip
24-11-2022  12:41           154,637 2127053.zip
28-02-2023  15:05    <DIR>          2129919
29-11-2022  16:40         9,059,733 2129919.zip
03-07-2022  11:53    <DIR>          21stMay-20220702T055745Z-001
30-07-2023  16:12         6,863,802 21stMay-20220702T055745Z-001.zip
24-04-2023  13:01           375,712 22b01038ed616ac43165687bedaaee45ee8fbebc93c75e197f48c529c415222e-2023-04-24-07-31-10.zip
30-08-2023  20:49           114,114 22b01038ed616ac43165687bedaaee45ee8fbebc93c75e197f48c529c415222e-2023-08-30-15-19-02.zip
07-09-2023  10:31    <DIR>          22b01038ed616ac43165687bedaaee45ee8fbebc93c75e197f48c529c415222e-2023-09-07-05-00-53
07-09-2023  10:31           132,147 22b01038ed616ac43165687bedaaee45ee8fbebc93c75e197f48c529c415222e-2023-09-07-05-00-53.zip
03-07-2022  11:53    <DIR>          22ndmay-20220702T055801Z-001
10-09-2022  23:12    <DIR>          23. Django-20220910T174146Z-001
10-09-2022  23:12           635,343 23. Django-20220910T174146Z-001.zip
25-12-2022  23:08           402,470 25resume.pdf
07-10-2022  21:35         2,513,681 25th Sept Industry ready 1-DS Project Flow.pdf
26-11-2022  17:58             9,280 26-11-2022.png
28-07-2023  21:29            24,900 28.ipynb
29-11-2022  14:00            12,498 28-11-2022.png
03-07-2022  11:53    <DIR>          28thmay-20220702T055846Z-001
09-02-2023  12:22           401,917 29resumefinal (1).pdf
09-02-2023  12:28           401,917 29resumefinal (2).pdf
09-02-2023  19:44           401,917 29resumefinal (3).pdf
12-02-2023  12:00           401,917 29resumefinal (4).pdf
29-01-2023  20:16           401,917 29resumefinal.pdf
03-07-2022  11:53    <DIR>          29thMay-20220702T055900Z-001
29-09-2022  05:58         4,936,410 2-Deep Learning-Activation Function,Loss Function,vanishing gradient problems.pdf
19-07-2022  22:15         6,177,864 2-RidgeLassoelasticLogistic.pdf
29-09-2022  06:00         3,811,002 3- Deep Learning optimizers.pdf
31-05-2023  16:29            53,051 30 May.rar
30-07-2023  15:18            23,986 30_07_firoj_tapan.ipynb
31-12-2022  22:15           310,589 31december-2022_production.png
03-01-2023  12:54         1,021,563 322231446_2145949_1838688_6299658.docx.pdf
16-12-2022  09:38         1,088,545 3494407_924284817_5221671127587.pdf
20-07-2022  20:30         4,476,715 3-NaiveBayes&KNN (1).pdf
06-01-2023  13:43    <DIR>          4000_2145811
29-12-2022  13:04             1,014 486285524_report.PNG
06-08-2022  20:04            46,783 48d054d7-9ca9-41a2-af20-6da22f7b1687.pdf
26-11-2022  09:50           371,264 57-Full Manuscript-303-1-10-20210101.pdf
05-09-2023  16:16           115,254 5-sep-23..Matplotlib.ipynb
03-07-2022  11:53    <DIR>          5thJune-20220702T060018Z-001
07-01-2023  11:15            40,869 610424553_8661673022502.PNG
03-01-2023  15:26            94,784 611890008_attach-file-1672689653245.xlsx
08-01-2023  13:05            32,708 6174694_2019475483_ITSecurityofAssetsAuditReport.docx
08-01-2023  13:05            52,373 6174695_773413174_answersheet.docx
30-11-2022  10:10    <DIR>          6202146_557902306_1711667066232
30-11-2022  10:08         4,336,189 6202146_557902306_1711667066232.zip
29-11-2022  17:08           192,888 6213366_724256128_8881667618211.pdf
29-11-2022  17:08           192,888 6213367_42476707_7311667618413.pdf
25-11-2022  10:06           319,905 6214359_1000821664_ISYS40251DerivingBusinessValue (1).docx
08-01-2023  13:04           319,905 6214359_1000821664_ISYS40251DerivingBusinessValue (2).docx
15-11-2022  21:58           319,905 6214359_1000821664_ISYS40251DerivingBusinessValue.docx
19-11-2022  20:37            17,603 6226585_977810161_ForecastingProjectFall20221 (1).docx
26-11-2022  17:33            20,243 6226585_977810161_ForecastingProjectFall20221 (2).docx
19-11-2022  20:03            17,603 6226585_977810161_ForecastingProjectFall20221.docx
26-11-2022  18:03           178,331 6227997_804850198_4311668368487 (1).pdf
25-11-2022  20:54           178,331 6227997_804850198_4311668368487.pdf
15-11-2022  21:59           376,297 6228599_713001643_606D817C-0AE9-4AF8-9679-8AC576.jpeg
24-11-2022  10:35           169,788 6244932_594254105_lab3.pdf
24-11-2022  16:13            63,116 6246945_1997681302_1571669247673 (1).docx
24-11-2022  10:33            63,116 6246945_1997681302_1571669247673.docx
25-11-2022  10:01           172,719 6248251_1610762773_5221669311232.pdf
26-11-2022  12:02            27,462 6248737_15177946_AssignmentRoverPart2.docx
29-11-2022  17:18           156,402 6253046_1015605848_Rawdata-assignment-20221116.zip
29-11-2022  10:49           187,004 6255566_1848008959_6871669689685 (1).rar
29-11-2022  10:49           187,004 6255566_1848008959_6871669689685.rar
30-11-2022  10:16            34,337 6256887_1144032372_4721669744820.docx
30-11-2022  10:31            17,680 6256973_658864227_3561669747930.docx
02-12-2022  09:40    <DIR>          6257614_970114486_CMSC733Assignment5
02-12-2022  09:37            40,181 6257614_970114486_CMSC733Assignment5.zip
02-01-2023  16:47           153,635 6284500_324218519_4231671106208 (1).pdf
02-01-2023  16:46           153,635 6284500_324218519_4231671106208.pdf
29-12-2022  12:08            14,023 6293639_1144537252_task3.docx
29-12-2022  17:33           232,403 6296326_1215288445_9411672312163.pdf
29-12-2022  17:30            57,383 6296343_971359209_6011672312673 (1).docx
29-12-2022  17:34            57,383 6296343_971359209_6011672312673 (2).docx
06-01-2023  14:04            57,383 6296343_971359209_6011672312673 (3).docx
29-12-2022  17:15            57,383 6296343_971359209_6011672312673.docx
30-12-2022  18:05             4,998 6297173_1069742042_9271672401337 (1).rar
30-12-2022  18:04             4,998 6297173_1069742042_9271672401337.rar
30-12-2022  18:07             3,000 6297175_1552145183_2901672401396.rar
02-01-2023  17:05            26,914 6298281_303235459_62978852120552226SCI442Coursew (1).docx
03-01-2023  12:07            26,914 6298281_303235459_62978852120552226SCI442Coursew (2).docx
02-01-2023  16:56            26,914 6298281_303235459_62978852120552226SCI442Coursew.docx
03-01-2023  14:01           143,842 6299068_948091880_5831672665101.png
03-01-2023  14:01           354,285 6299069_207794875_6801672665102.pdf
03-01-2023  15:32            13,303 6299357_465611549_7671672685975.docx
03-01-2023  15:32         5,057,999 6299358_68953781_8531672685976.xlsx
03-01-2023  15:32        50,512,925 6299359_1675536243_3811672685978.xlsx
03-01-2023  15:23            94,784 6299371_175633961_6431672687293.xlsx
03-01-2023  20:50            22,089 6299849_410794984_5291672744220.docx
03-01-2023  20:52           581,082 6299990_898942029_6041672751306.pdf
05-01-2023  16:37           239,959 6301385_1625681581_2191672881498.pdf
07-01-2023  16:25           261,717 6301425_1448130059_7801672890194.docx
07-01-2023  16:25           212,207 6301426_654502130_9391672890196.docx
07-01-2023  16:23       201,617,580 6301722_238167626_4761672913933 (1).docx
05-01-2023  22:18       201,617,580 6301722_238167626_4761672913933.docx
07-01-2023  16:18           168,819 6303202_1793967889_8071673025731.gif
07-01-2023  16:18           179,000 6303203_1296589249_8851673025731.gif
07-01-2023  16:17           208,620 6303204_300042897_4791673025732.gif
07-01-2023  16:17           178,322 6303206_1885821677_5561673025733.gif
07-01-2023  15:18           231,559 6303420_654443766_5141673049427.pdf
03-09-2022  11:53           543,608 6a2d2d74-fd47-4c8e-9305-83c33f35b46f.pdf
03-01-2023  20:53         2,991,850 719257568_2871672743580.rar
07-01-2023  12:31        37,137,379 881577687_marketing_campaign.csv.pdf
02-07-2022  11:30         7,136,886 8-Gradientboosting-kmeanshierarichal.pdf
29-06-2022  17:02         6,328,057 8thJanStats3.pdf
29-06-2022  17:02         6,662,750 9thJanStats4.pdf
06-06-2023  13:31            54,013 abc.pdf
10-06-2023  13:49           261,128 Account_Statement_100323_090623.pdf
10-06-2023  13:52           282,455 Account_Statement_3month.pdf
10-06-2023  13:50           261,128 Account_Statement_last3month.pdf
29-09-2022  05:59         3,253,779 activation function.zip
12-10-2022  21:35            21,390 Advanced+Excel+Analytics+in+Excel.xlsx
27-10-2022  13:15            61,223 AI ENGINEER MATRIX.xlsx
16-07-2023  14:46         3,999,366 airbanb.pdf
31-03-2023  18:45             1,746 AirPassengers.csv
08-01-2023  13:06            28,742 annotated bibliography.docx
04-08-2022  21:13           510,875 aPI.pdf
29-09-2022  06:11         1,416,716 Apple+quarterly+balance+sheet.pdf
29-09-2022  06:11         1,429,366 Apple+quarterly+balance+sheet+1.pdf
10-06-2023  13:53           427,017 Apr'23 (1).pdf
08-06-2023  09:39           427,017 Apr'23.pdf
02-09-2022  17:49    <DIR>          archive
03-09-2022  13:06    <DIR>          archive (1)
03-09-2022  13:05           641,269 archive (1).zip
02-09-2022  17:48         5,732,543 archive.zip
12-12-2022  15:08           524,200 AReM.zip
10-03-2023  18:49         1,103,184 arnaud-jaegers-Al7IoQ74-LU-unsplash.jpg
12-03-2023  14:33    <DIR>          asd.py
31-05-2023  17:05                89 asdf.txt
10-03-2023  21:49    <DIR>          ASSIGNMENT
29-09-2022  19:54        10,401,953 assignment (2) (2).xlsx
30-07-2022  22:27           104,846 atlassian-git-cheatsheet.pdf
19-04-2023  09:58    <DIR>          AWS
07-06-2023  11:22           579,043 bank.zip
07-06-2023  11:22           444,572 bank-additional.zip
23-01-2023  22:29           391,059 bas_resume23.pdf
08-01-2023  13:06            15,587 Basics.docx
01-12-2022  16:05    <DIR>          Big_Data_Analytics_UZH-master
01-12-2022  16:04           744,774 Big_Data_Analytics_UZH-master.zip
17-12-2022  13:54    <DIR>          book_rating_prediction
17-12-2022  14:45       101,781,720 book_rating_prediction17.zip
27-01-2023  11:24            17,462 Book1.xlsx
17-12-2022  13:44    <DIR>          bookprediction
16-12-2022  13:22         1,032,922 books_model.pkl
16-12-2022  14:01         1,346,128 bostonhousepricing-main.zip
27-06-2023  20:36    <DIR>          BUSINESS
27-06-2023  21:32        97,291,742 BUSINESS (2).zip
25-06-2023  14:14        97,109,862 BUSINESS.zip
23-03-2023  19:56           555,360 c76bb6b8-8d0d-42ca-8438-976e438247bf.pdf
04-07-2023  12:14            53,593 car_evaluation.csv
07-10-2022  17:33            26,717 CarPrice_Assignment.csv
07-01-2023  13:24    <DIR>          case notes
16-10-2022  12:44           808,213 CCI02252019_0005.jpg
16-10-2022  12:46           706,992 CCI02252019_0005-min.jpg
16-10-2022  12:48           655,726 CCI02252019_0005-minedi.jpg
27-04-2023  11:19             5,132 chatgpt.jpeg
03-04-2023  15:51    <DIR>          chromedriver_win32
09-06-2023  21:49    <DIR>          chromedriver_win32 (1)
09-06-2023  21:47         6,603,303 chromedriver_win32 (1).zip
03-04-2023  15:51         7,117,143 chromedriver_win32.zip
14-04-2023  15:23                57 Class schedule.csv
14-04-2023  15:14            25,600 Class schedule.xls
27-09-2022  15:06    <DIR>          Class_notebooks-20220927T091839Z-001
27-09-2022  14:49         3,661,484 Class_notebooks-20220927T091839Z-001.zip
22-04-2023  16:39             3,516 cleaneddata (1).csv
22-04-2023  16:38             4,007 cleaneddata.csv
29-05-2023  14:39    <DIR>          code
29-05-2023  12:43        42,822,011 code.zip
08-06-2023  09:42         1,282,675 combinepdf.pdf
12-03-2023  14:34    <DIR>          computer vision
10-09-2023  22:53                 0 computer.txt
03-09-2022  17:55           299,120 conda-cheatsheet (1).pdf
05-06-2023  12:14           299,120 conda-cheatsheet (2).pdf
03-09-2022  17:55           787,695 conda-cheatsheet.pdf
29-01-2023  13:56             1,083 Configuration.xml
01-08-2022  14:05         2,434,564 Crop Recommendation System Project.pdf
20-04-2023  20:42         3,014,476 Customer Profitability Sample PBIX.pbix
20-04-2023  20:43         2,906,427 Customer Profitability Sample-no-PV.xlsx
25-05-2023  14:03    <DIR>          cv2
24-09-2022  21:51    <DIR>          Data
07-10-2022  17:17            14,884 Data Dictionary - carprices.xlsx
24-09-2022  21:50           709,466 Data.zip
10-09-2023  22:50                 0 data10.txt
13-03-2023  11:52           379,397 data-analytics iamge.html
12-10-2022  17:54    <DIR>          database.sqlite
18-03-2023  11:34       133,811,040 database.sqlite.zip
31-07-2022  18:17       372,798,464 database1.sqlite
12-10-2022  17:46                 0 database5.sqlite
22-04-2023  16:43             8,347 dataexcel (1).xlsx
22-04-2023  16:42             9,286 dataexcel.xlsx
13-09-2022  21:40        24,741,696 dataset (1).rar

02-01-2023  15:48            28,209 dataset issue.png
13-09-2022  21:39        24,741,696 dataset.rar
27-04-2023  16:32    <DIR>          data-society-global-terrorism-data
31-03-2023  20:14           118,690 Dax 2.pbix
31-03-2023  18:08           430,086 DAX.pbix
11-10-2022  13:38         2,493,152 Day04-Docker-20221011T080805Z-001.zip
07-01-2023  13:33            31,303 ddddddWRrrrrrrr.png
05-08-2022  11:46         1,569,899 Deep learning (2).pdf
01-08-2022  14:05           378,488 Deep Learning.pdf
06-12-2022  14:50    <DIR>          Deployement
27-09-2022  18:35    <DIR>          Diabetes-prediction-project-main
27-09-2022  18:35         1,576,224 Diabetes-prediction-project-main.zip
27-09-2022  18:34           510,271 diabetes-prediction-rfc-model.pkl
16-07-2023  14:46           970,487 diamond price.pdf
08-01-2023  13:06           546,634 Dissertation.pptx
09-09-2022  21:49    <DIR>          Django-Socialauth-master
09-09-2022  21:49           146,954 Django-Socialauth-master.zip
11-10-2022  12:49    <DIR>          DL_Tensor_Flow.7z (Unzipped Files)-20221011T071416Z-001
11-10-2022  12:44            15,979 DL_Tensor_Flow.7z (Unzipped Files)-20221011T071416Z-001.zip
27-09-2022  15:06    <DIR>          DL1-20220927T091704Z-001
27-09-2022  14:47           134,638 DL1-20220927T091704Z-001.zip
23-09-2022  12:45       548,820,824 Docker Desktop Installer.exe
03-09-2022  19:23           143,755 docker-cheat-sheet.pdf
21-04-2023  21:32    <DIR>          Docker-For-Data-Science-main
21-04-2023  21:32         1,987,474 Docker-For-Data-Science-main.zip
08-01-2023  13:06           973,700 document.pdf
04-11-2022  15:52         4,447,549 DOCUMENTS FOR GLOBAL LOGIC.pdf
04-11-2022  15:53         4,446,281 DOCUMENTS FOR GLOBAL LOGIC-1-11.pdf
04-11-2022  15:26         4,970,179 Documents_samatrix.zip
11-06-2023  15:05             7,255 dog_image_11.jpeg
08-05-2023  16:46             5,712 dogimage.jpeg
03-01-2023  16:24            33,894 DWRRRRRRR03012023.png
29-12-2022  18:29            28,405 dwrrrrrrrrrrrr29122022.png
01-04-2023  10:01    <DIR>          EDA
16-10-2022  19:11             4,363 Email_OTP_RU380328.pdf
29-09-2022  06:11            20,859 employee_ctc_pdf_load_solved.xlsx
29-09-2022  06:12           203,553 Employee+data.pdf
14-07-2023  20:37            59,175 employees.csv
31-08-2022  20:11    <DIR>          End-to-End-Diabetes-Prediction-Application-Using-Machine-Learning-master
08-01-2023  13:06            18,508 Essay template.docx
03-11-2022  13:04                63 Example.txt
03-06-2023  13:10                 0 example03.txt
10-09-2023  23:26               245 example10.txt
22-05-2023  17:04    <DIR>          Excel
19-08-2022  14:20         1,513,112 Excel Analyticxs.pdf
31-05-2023  11:23    <DIR>          Excel_Notes
22-05-2023  17:04        52,764,710 Excel_Notes.zip
24-09-2022  22:50    <DIR>          Exercise
24-09-2022  21:52        24,431,113 Exercise.zip
22-03-2023  13:29    <DIR>          export_data
22-03-2023  13:30           166,341 export_data (1)
05-06-2023  10:32        13,091,720 F&B Sales -20230605T050228Z-001.zip
19-08-2022  13:38               230 Fabionacci.py
27-04-2023  11:18             3,717 Facebook.jpeg
10-06-2023  13:53           428,601 Feb'23 (1).pdf
08-06-2023  09:39           428,601 Feb'23.pdf
16-09-2022  19:48        14,064,278 FifteenThousandUsefulPhrases_10777354.pdf
14-10-2022  14:06    <DIR>          fig_code
21-02-2023  13:56            22,016 file_example_XLS_10.xls
20-11-2022  08:12           189,963 Final Solution.xlsx
19-03-2023  13:15             1,709 final_data.csv
27-02-2023  13:56             8,949 final_file.xlsx
19-04-2023  13:26           414,671 Final_updated_resume19.pdf
14-10-2022  10:50             1,417 finalised_kmeans_model.sav
13-01-2023  22:01             1,613 finalized_model.pickle
14-10-2022  23:45             3,856 finalized_model1456.pickle
23-01-2023  15:22           401,602 finalresume2301.pdf
27-01-2023  11:45           394,597 finalteleresume.pdf
07-06-2023  11:19           392,434 Financial Analytics.pdf
09-10-2022  22:15         3,663,063 firstfigure.html
06-05-2023  17:13    <DIR>          Flask
05-06-2023  11:28    <DIR>          Flask (1)
05-06-2023  11:24           716,535 Flask (1).zip
06-05-2023  17:10           716,535 Flask.zip
06-09-2022  06:08    <DIR>          flask_demo-20220905T235450Z-001
06-09-2022  05:25             7,623 flask_demo-20220905T235450Z-001.zip
06-09-2022  15:06    <DIR>          Flaskpractice
31-12-2022  20:31       101,827,904 flickr_logos_27_dataset.tar.gz
05-09-2022  15:06    <DIR>          Flight-Price-Prediction-master
12-12-2022  14:10       200,911,530 flights.zip
27-02-2023  13:59            25,478 forestfires.csv
26-01-2023  17:24            16,947 Formatting+data+and+tables.xlsx
29-12-2022  17:53           173,585 General instructions (1).pptx
08-01-2023  13:06           173,585 General instructions (2).pptx
02-12-2022  17:43           173,585 General instructions.pptx
25-03-2023  22:12         2,574,273 get-pip.py
30-07-2022  22:24        49,381,480 Git-2.37.1-64-bit (1).exe
30-07-2022  13:08        49,381,480 Git-2.37.1-64-bit.exe
01-10-2022  10:14        49,375,864 Git-2.37.3-64-bit.exe
30-07-2022  22:26           100,194 git-cheat-sheet-education.pdf
12-09-2022  19:34                29 gog.py
27-04-2023  11:18             3,326 Google.png
23-11-2022  13:42        14,599,992 GrammarlyInstaller.c000000702OBVqdpuIdS.exe
17-06-2023  14:45           489,998 group_photo.jpg
19-08-2022  13:40                41 hello.py
21-04-2023  23:42    <DIR>          Hello_my_world
14-09-2022  13:24                32 helloworld.py
01-09-2023  22:02            67,646 home_icon-icons.com_73532.ico
13-06-2023  09:27    <DIR>          HR-Dashboard-MySQL-PowerBI-main
12-06-2023  12:08         1,462,559 HR-Dashboard-MySQL-PowerBI-main.zip
19-05-2023  17:14            17,981 i5.jpg
11-10-2022  22:35           720,864 ib sig 2021.jpg
08-06-2023  12:00           308,099 ilovepdf_merged.pdf
17-06-2023  16:03            54,610 img1.jpg
17-06-2023  16:03            52,849 img2.jpg
17-06-2023  16:03            48,395 img3.jpg
17-06-2023  16:03            41,330 img4.jpg
17-06-2023  16:04            96,862 img5.jpeg.jpg
13-12-2022  12:01               105 Index
26-01-2023  22:50            22,730 Indirect+Function.xlsx
05-06-2023  10:46    <DIR>          iNeuron_FSDA-main-20230605T051534Z-001
05-06-2023  10:46        12,630,373 iNeuron_FSDA-main-20230605T051534Z-001.zip
12-06-2023  10:05    <DIR>          iNeuron_FSDA-main-20230612T042137Z-001
12-06-2023  10:04        12,630,373 iNeuron_FSDA-main-20230612T042137Z-001.zip
10-03-2023  20:15    <DIR>          iNeuron-Full-Stack-Data-Science-Assignments-main
10-03-2023  20:12       144,869,666 iNeuron-Full-Stack-Data-Science-Assignments-main.zip
19-08-2022  17:17                29 infile.py
18-08-2022  22:59            73,216 inter.jfif
10-08-2022  20:13           277,130 Internship Certificate internship certi.pdf
13-09-2022  21:58         1,160,337 introduction.pptx
28-10-2022  12:49             4,633 invite.ics
23-06-2023  20:39             3,858 iris.csv
25-02-2023  13:12             2,998 iris.names
30-07-2023  11:16             3,858 iris30.csv
27-10-2022  13:15            13,275 JD AI ENGINEER.docx
05-09-2022  17:49           644,465 JD Python Developer Speech  - Ozonetel - Sudhamay Maity.pdf
15-04-2023  12:11               947 JioMeet Invite.ics
16-09-2022  19:47           447,946 Job-Interviews-In-English_Series-One-Pack.pdf
16-09-2022  19:44           582,510 KEY_PHRASES_FOR_INTERVIEWS.pdf
20-09-2022  19:22         6,631,527 KMS_Pico_Full_Setup.zip
03-12-2022  14:38         1,480,659 konect-handbook (1).pdf
03-12-2022  14:05         1,480,659 konect-handbook.pdf
08-10-2022  14:55    <DIR>          latestversion
26-01-2023  22:51            11,907 Lecture_Maps_Unsolved.xlsx
06-11-2022  21:22         2,014,901 Linear Regression on Algerian Forest Fire Dataset.pdf
25-10-2022  21:51         1,574,096 Linear_Regression_Task.pdf
16-07-2023  15:28    <DIR>          Linear-Regression-Prediction-Project-Part-1-master
16-07-2023  14:58            46,173 Linear-Regression-Prediction-Project-Part-1-master.zip
23-09-2022  14:12           412,306 Linkresume.pdf
07-10-2022  12:34           469,423 Linuc commands.pdf
25-08-2022  11:13           469,423 Linux commands.pdf
30-07-2023  16:11    <DIR>          Logistic-Regression-master
30-07-2023  16:10             4,872 Logistic-Regression-master.zip
20-04-2023  16:24               440 loss.txt
16-04-2023  10:29        21,573,975 Machine Learning Module 1-20230416T045929Z-001.zip
19-06-2023  15:27        21,573,975 Machine Learning Module 1-20230619T095712Z-001.zip
06-05-2023  10:00        58,202,095 Machine Learning Module 2-20230506T042824Z-001.zip
06-05-2023  10:01         6,134,873 Machine Learning Module 3-20230506T043140Z-001.zip
06-05-2023  10:00         6,815,512 Machine Learning Module 4-20230506T042949Z-001.zip
06-05-2023  10:01        72,129,159 Machine Learning Module 5-20230506T043049Z-001.zip
12-03-2023  14:35                 0 machine learning.txt
31-08-2022  19:46    <DIR>          Machine-Learning-Projects-master
31-08-2022  19:41       122,583,229 Machine-Learning-Projects-master.zip
30-07-2023  16:08        59,444,333 Machine-Learning-with-Python-master.zip
12-10-2022  21:14            28,246 Macros.xlsm
09-02-2023  19:42           402,072 Main_resume.pdf
10-06-2023  13:53           427,926 Mar'23 (1).pdf
08-06-2023  09:39           427,926 Mar'23.pdf
25-03-2023  18:13           465,112 Markov_Chain_project.ipynb
26-06-2023  00:41           893,466 matplotlib_revision (1).ipynb
26-06-2023  00:24           797,968 matplotlib_revision.ipynb
02-07-2023  11:51            57,345 may_salary_bank_statment_unlocked.pdf
04-01-2023  16:52            85,263 message section is not availble.png
03-12-2022  13:56         1,706,855 metro-trips-2022-q3 (1).zip
02-12-2022  17:31         1,706,855 metro-trips-2022-q3.zip
06-05-2023  09:10    <DIR>          ML
06-08-2023  15:00    <DIR>          ML Notes
03-09-2022  14:26         4,115,949 ML NOtes.pdf
06-05-2023  09:10        52,847,990 ML Notes.zip
23-09-2022  14:34    <DIR>          ML11 4-20220923T083136Z-001
08-01-2023  13:05           245,359 mla-referencing-guide.pdf
12-02-2023  11:29                 0 mlfile.txt
27-04-2023  11:19             6,911 MLimage.jpeg
12-09-2022  19:35    <DIR>          mod1
14-10-2022  23:09               815 modelForPrediction145.sav
23-06-2023  21:37             4,009 modified2306.csv
01-05-2023  15:13            10,156 Module 4 - Outline.docx
13-03-2023  14:44    <DIR>          Moduls_13
02-11-2022  17:33           150,206 Mr. Sanjay Kumar- Employment Offer.pdf
01-12-2022  11:24    <DIR>          MushroomDataset
01-12-2022  11:20           473,175 MushroomDataset.zip
12-06-2023  11:56           173,473 Music_Store_database (1).sql
12-06-2023  11:45           173,473 Music_Store_database.sql
19-03-2023  13:39    <DIR>          my_cleaned_data
20-03-2023  10:36    <DIR>          my_expoted_file
26-06-2023  00:07            42,775 my_modified_img.jpg
03-11-2022  11:31                96 My_newcustom0311.py
25-06-2023  23:48             7,944 my_pic_face.jpg
30-04-2023  14:54             8,100 my_pikachu_image.jpg
04-06-2023  17:19    <DIR>          my_project
16-12-2022  14:02    <DIR>          mybostonhousepricing-main
07-10-2022  17:41            27,405 mycsv.csv
15-10-2022  19:15    <DIR>          Myenvirement
22-03-2023  13:28           147,525 myexported_data.csv
08-05-2023  07:20               145 myfile.py
03-06-2023  13:13                 0 myfile0306.txt
05-06-2023  11:47    <DIR>          myflask_practice
23-06-2023  21:39             8,666 myirisexcel.xlsx
12-02-2023  12:55               236 mymlfile2023.txt
17-09-2022  13:06               219 mymodule.py
12-10-2022  13:40    <DIR>          mynlp
02-04-2023  14:57             7,923 mypicachuface.jpg
24-03-2023  13:46        16,117,760 mysql-connector-net-8.0.32.msi
02-03-2023  14:03         2,506,752 mysql-installer-web-community-8.0.32.0 (1).msi
04-03-2023  13:27         2,506,752 mysql-installer-web-community-8.0.32.0 (2).msi
23-03-2023  16:29         2,506,752 mysql-installer-web-community-8.0.32.0 (3).msi
02-03-2023  14:02         2,506,752 mysql-installer-web-community-8.0.32.0.msi
16-03-2023  21:31    <DIR>          mysqlsampledatabase
22-04-2023  16:59    <DIR>          mysqlsampledatabase (1)
22-04-2023  16:58            54,335 mysqlsampledatabase (1).zip
16-03-2023  21:31            54,335 mysqlsampledatabase.zip
27-02-2023  13:55             4,309 myupdatedfile123.csv
30-11-2022  11:49    <DIR>          myZip_s2131748
02-01-2023  15:27         2,569,544 myZip_s2145892.zip
03-01-2023  12:29    <DIR>          myZip_s2146433
03-01-2023  12:28       151,723,886 myZip_s2146433.zip
05-01-2023  16:38    <DIR>          myZip_s2147122
05-01-2023  16:37           304,892 myZip_s2147122.zip
27-01-2023  11:24            17,734 Named+Ranges.xlsx
14-11-2022  07:32    <DIR>          NerdyTurtlez
14-03-2023  09:42                 0 New Text Document.txt
04-11-2022  10:42           411,545 new_link resume (1).pdf
15-09-2022  21:22           411,545 new_link resume.pdf
24-09-2022  18:39           774,608 new_link resume_page-0001.jpg
18-06-2023  14:52            40,904 new_my_image.jpg
11-09-2022  11:16    <DIR>          newdjango
03-11-2022  14:42                79 newfile.txt
12-02-2023  11:24                 0 newfile12022023.txt
23-07-2022  12:59               133 newonefile.txt
09-06-2023  19:37               256 newtestfile03.txt
19-04-2023  14:43           420,626 NewUpdated_resume19.pdf
02-01-2023  16:25            22,464 newyearDWR2023.png
30-05-2023  15:13    <DIR>          NLP Projectsss
30-05-2023  15:06    18,966,330,907 NLP Projectsss.zip
16-04-2023  17:06    <DIR>          NLP-20230416T101243Z-001
16-04-2023  15:44       534,675,109 NLP-20230416T101243Z-001.zip
07-01-2023  13:33    <DIR>          nnerdytutlez
16-10-2022  19:11            61,554 noname
16-10-2022  19:11            23,770 noname (1)
20-09-2022  18:33           170,384 nresume.pdf
30-07-2022  11:40           280,866 NUMPY Cheatsheet.pdf
29-01-2023  13:59         3,664,056 officedeploymenttool_15928-20216 (1).exe
29-01-2023  13:48         3,664,056 officedeploymenttool_15928-20216.exe
05-06-2023  10:59         3,674,056 officedeploymenttool_16327-20214.exe
02-09-2023  22:52             5,330 One_liners.ipynb
08-05-2023  11:44       464,763,552 On-premises data gateway (personal mode).exe
13-09-2023  00:23            38,832 OOPs_13.ipynb
20-05-2023  12:57         1,399,205 Open_cv_07_05_2023 (1).ipynb
20-05-2023  10:57         1,388,571 Open_cv_07_05_2023.ipynb
27-07-2022  19:31        10,269,576 opencv_haarcascade_frontalface_default.xml at master ú opencv_opencv.html
27-07-2022  19:31    <DIR>          opencv_haarcascade_frontalface_default.xml at master ú opencv_opencv_files
07-01-2023  16:10    <DIR>          Orde_rId_2145311_7
29-11-2022  16:30         2,531,769 Order_Id_2129919.html
14-08-2023  14:05         1,863,231 Order_Id_2129919.ipynb
01-12-2022  12:47         2,311,913 Order_Id_2129919_a.pdf
29-11-2022  16:30         2,262,677 Order_Id_2129919_final_pdf.pdf
05-01-2023  16:02    <DIR>          Order_Id_2145622
02-01-2023  16:37         1,372,132 Order_Id_2145721_3100_02012022.html
04-01-2023  17:19    <DIR>          Order_Id_2145892_5540
03-01-2023  13:21    <DIR>          Order_Id_2145949_1200_maths
02-12-2022  18:18           562,344 order_no_2132070.zip
19-08-2022  17:21                51 outfile.py
24-09-2022  10:20    <DIR>          p1
03-09-2022  19:21           118,785 p2.jpeg
25-10-2022  21:51           611,052 Pandas Cheat Sheet.pdf
06-11-2022  21:37         6,345,977 Pandas Dataframe Complete Cheatsheet.pdf
04-07-2023  13:18           296,843 Pandas_12PM_04_07.ipynb
14-09-2023  23:32           144,705 Pandas_numpy_revision_14.ipynb
01-12-2022  11:51        25,219,072 pandoc-2.19.2-windows-x86_64.msi
10-03-2023  16:35       482,003,928 PBIDesktopSetup_x64.exe
29-09-2022  06:11            17,654 PDF_import_solved.xlsx
16-12-2022  13:41            17,291 penalty grid (1).docx
12-12-2022  12:47            17,291 penalty grid.docx
15-01-2023  16:06    <DIR>          Phishing-Website-Detection-by-Machine-Learning-Techniques-master
15-01-2023  15:59         2,843,304 Phishing-Website-Detection-by-Machine-Learning-Techniques-master.zip
18-12-2022  11:25    <DIR>          phising
26-04-2023  11:16            63,214 photo-1611003228941-98852ba62227.jpeg
16-10-2022  12:06            46,240 pic1.jpg
19-09-2022  18:42         1,180,881 Pima_diabetes_Tree.png
26-01-2023  22:51           117,644 Pivot+Tables.xlsx
19-05-2023  20:59         3,376,352 Plotly and Cufflinks Crash Course.ipynb.zip
10-03-2023  19:15    <DIR>          Power Bi
23-03-2023  14:51    <DIR>          Power BI Assignment
18-05-2023  10:14    <DIR>          Power BI DAX-20230508T020104Z-001
08-05-2023  07:31        15,004,554 Power BI DAX-20230508T020104Z-001.zip
14-03-2023  09:12    <DIR>          Power BI Material-20230314T034136Z-001
14-03-2023  09:12        90,687,244 Power BI Material-20230314T034136Z-001.zip
05-06-2023  11:16            20,082 Power_BI_Project.zip
17-09-2022  10:41    <DIR>          PowerBi Project-20220917T050125Z-001
05-06-2023  10:20    <DIR>          PowerBi Project-20230605T044903Z-001
05-06-2023  10:19           216,335 PowerBi Project-20230605T044903Z-001.zip
20-04-2023  20:54    <DIR>          Power-BI-raw-data-master
20-04-2023  20:54         9,833,575 Power-BI-raw-data-master.zip
13-01-2023  16:48    <DIR>          Practice
04-08-2023  19:47            30,813 practice day 1.ipynb
24-09-2022  21:52    <DIR>          Presentations
24-09-2022  21:52         1,317,567 Presentations.zip
24-09-2022  16:20    <DIR>          Product-20211124T053757Z-001
24-09-2022  16:19        19,548,195 Product-20211124T053757Z-001.zip
20-04-2023  11:10                 0 profit.txt
29-07-2022  20:09         2,161,950 project discussion.pdf
05-09-2022  15:16    <DIR>          Projects
03-09-2022  12:31            17,861 Proposal 8 26.docx
24-03-2023  15:03       423,849,032 pycharm-community-2022.3.3.exe
18-03-2023  15:17    <DIR>          Python Basic Assignment
04-04-2023  16:01        24,381,614 Python Programming.zip
27-04-2023  11:39             2,842 python.jpeg
03-09-2023  00:40        31,830,944 python-3.6.8-amd64 (1).exe
14-08-2023  00:59        31,830,944 python-3.6.8-amd64.exe
13-03-2023  10:01                85 pythoncustom.py
25-02-2023  11:09    <DIR>          python-data-science-mastercourse-main
24-03-2023  15:41    <DIR>          python-programming-master-course-main
13-03-2023  10:01                57 pythonproject.py
20-04-2023  21:09    <DIR>          Python-Tutorial-2022--main
20-04-2023  21:08        26,839,563 Python-Tutorial-2022--main.zip
11-10-2022  12:47            45,893 PyTorch 1.1.ipynb
05-09-2023  01:19            39,989 Question_Practice.ipynb
08-01-2023  13:05           109,841 reference-examples.pdf
08-01-2023  13:05           225,724 reference-guide.pdf
08-01-2023  13:06            16,422 Report and article.docx
11-12-2022  20:51        17,759,562 Report_bike_sharing_data.docx
08-01-2023  13:07           543,960 research proposal template.pdf
08-01-2023  13:04            83,430 research report.docx
08-01-2023  13:04            21,086 research report_management.docx
02-06-2023  11:09           414,671 resume_nov_27.pdf
01-09-2023  17:59           454,759 Resume29_08.pdf
05-06-2023  12:57         1,774,288 review scrapper (1).ipynb
24-03-2023  15:15         1,766,609 review scrapper.ipynb
25-03-2023  15:46           126,011 salary negotiation.jpg
22-03-2023  13:32    <DIR>          Sales_data
20-04-2023  11:03                 0 salesfile.txt
30-08-2022  21:07                56 samplejson.json
09-11-2022  12:07           410,816 Sanjay Kumar (1).pdf
04-11-2022  15:56           301,712 Sanjay Kumar.pdf

In [392]:
df = pd.read_csv('./iris.csv')

In [393]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [394]:
type(df)

pandas.core.frame.DataFrame

In [395]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [396]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [397]:
df.shape

(150, 5)

In [398]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [399]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [400]:
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [402]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [403]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [404]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.054000      3.758667     1.198667     NaN
std         0.828066     0.433594      1.764420     0.763161     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [405]:
df.describe(include='object')

       species
count      150
unique       3
top     setosa
freq        50

In [407]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [409]:
df.species.nunique()

3

In [413]:
df[df.species == 'versicolor'].shape

(50, 5)

In [417]:
df.species.value_counts()['setosa']

50

In [419]:
df.petal_length.min()

1.0

In [420]:
df.petal_width.sum()

179.8

In [421]:
df.sepal_length.max()

7.9

In [423]:
round(df.sepal_width.mean())

3

In [424]:
df['petal_width']

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64

In [425]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [434]:
df.sort_values(by=['sepal_length','sepal_width'], ascending=[True, False])

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In [438]:
df = df.sort_values(by='petal_length', ascending=False)

In [440]:
df.sort_index()

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [441]:
import pandas as pd

In [442]:
df = pd.read_csv('https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv')

In [446]:
df.sepal_length = df.sepal_length.apply(lambda x:round(x))

In [447]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0               5          3.5           1.4          0.2     setosa
1               5          3.0           1.4          0.2     setosa
2               5          3.2           1.3          0.2     setosa
3               5          3.1           1.5          0.2     setosa
4               5          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145             7          3.0           5.2          2.3  virginica
146             6          2.5           5.0          1.9  virginica
147             6          3.0           5.2          2.0  virginica
148             6          3.4           5.4          2.3  virginica
149             6          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [450]:
df.species.apply(len)

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [452]:
df.apply(lambda x:x+x)

     sepal_length  sepal_width  petal_length  petal_width             species
0              10          7.0           2.8          0.4        setosasetosa
1              10          6.0           2.8          0.4        setosasetosa
2              10          6.4           2.6          0.4        setosasetosa
3              10          6.2           3.0          0.4        setosasetosa
4              10          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145            14          6.0          10.4          4.6  virginicavirginica
146            12          5.0          10.0          3.8  virginicavirginica
147            12          6.0          10.4          4.0  virginicavirginica
148            12          6.8          10.8          4.6  virginicavirginica
149            12          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

In [453]:
# Grouping data together

In [454]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0               5          3.5           1.4          0.2     setosa
1               5          3.0           1.4          0.2     setosa
2               5          3.2           1.3          0.2     setosa
3               5          3.1           1.5          0.2     setosa
4               5          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145             7          3.0           5.2          2.3  virginica
146             6          2.5           5.0          1.9  virginica
147             6          3.0           5.2          2.0  virginica
148             6          3.4           5.4          2.3  virginica
149             6          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [461]:
df.aggregate('min')

sepal_length         4
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [462]:
df.agg('min')

sepal_length         4
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [464]:
df.agg(['min', 'max', 'median', 'mean'])

<ipython-input-464-025d06ef7e78>:1: FutureWarning: ['species'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.agg(['min', 'max', 'median', 'mean'])

        sepal_length  sepal_width  petal_length  petal_width    species
min             4.00        2.000      1.000000     0.100000     setosa
max             8.00        4.400      6.900000     2.500000  virginica
median          6.00        3.000      4.350000     1.300000        NaN
mean            5.86        3.054      3.758667     1.198667        NaN

In [466]:
df.aggregate(['min', 'max', 'mean', 'median'])

<ipython-input-466-ffcb6e11e7e8>:1: FutureWarning: ['species'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.aggregate(['min', 'max', 'mean', 'median'])

        sepal_length  sepal_width  petal_length  petal_width    species
min             4.00        2.000      1.000000     0.100000     setosa
max             8.00        4.400      6.900000     2.500000  virginica
mean            5.86        3.054      3.758667     1.198667        NaN
median          6.00        3.000      4.350000     1.300000        NaN

In [469]:
groupby_obj = df.groupby('species')

In [470]:
groupby_obj

In [471]:
groupby_obj.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                 4          2.3           1.0          0.1
versicolor             5          2.0           3.0          1.0
virginica              5          2.2           4.5          1.4

In [472]:
groupby_obj.count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [473]:
groupby_obj.corr()

                         sepal_length  sepal_width  petal_length  petal_width
species
setosa     sepal_length      1.000000     0.652096      0.182252     0.126412
           sepal_width       0.652096     1.000000      0.176695     0.279973
           petal_length      0.182252     0.176695      1.000000     0.306308
           petal_width       0.126412     0.279973      0.306308     1.000000
versicolor sepal_length      1.000000     0.458796      0.609492     0.377180
           sepal_width       0.458796     1.000000      0.560522     0.663999
           petal_length      0.609492     0.560522      1.000000     0.786668
           petal_width       0.377180     0.663999      0.786668     1.000000
virginica  sepal_length      1.000000     0.387986      0.815619     0.333739
           sepal_width       0.387986     1.000000      0.401045     0.537728
           petal_length      0.815619     0.401045      1.000000     0.322108
           petal_width       0.333739     0.537728      0.322108     1.000000

In [474]:
groupby_obj.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               250        170.9          73.2         12.2
versicolor           302        138.5         213.0         66.3
virginica            327        148.7         277.6        101.3

In [475]:
groupby_obj.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa              5.00        3.418         1.464        0.244
versicolor          6.04        2.770         4.260        1.326
virginica           6.54        2.974         5.552        2.026

In [481]:
df[df.species=='setosa']['sepal_width'].mean()

3.418

In [484]:
groupby_obj.describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.000000    6.040000   6.540000
             std     0.451754    0.532993   0.734291
             min     4.000000    5.000000   5.000000
             25%     5.000000    6.000000   6.000000
             50%     5.000000    6.000000   6.000000
             75%     5.000000    6.000000   7.000000
             max     6.000000    7.000000   8.000000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.418000    2.770000   2.974000
             std     0.381024    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.125000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.464000    4.260000   5.552000
             std     0.173511    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.244000    1.326000   2.026000
             std     0.107210    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [487]:
df.species.apply(lambda x:x.upper())

0         SETOSA
1         SETOSA
2         SETOSA
3         SETOSA
4         SETOSA
         ...
145    VIRGINICA
146    VIRGINICA
147    VIRGINICA
148    VIRGINICA
149    VIRGINICA
Name: species, Length: 150, dtype: object

In [488]:
# Handling missing data

In [489]:
import numpy as np

In [492]:
idx = np.random.randint(1,100, 15)

In [495]:
import warnings
warnings.filterwarnings('ignore')

In [496]:
df.sepal_length[idx] = np.nan

In [497]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.0          3.5           1.4          0.2     setosa
1             NaN          3.0           1.4          0.2     setosa
2             5.0          3.2           1.3          0.2     setosa
3             5.0          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           7.0          3.0           5.2          2.3  virginica
146           6.0          2.5           5.0          1.9  virginica
147           6.0          3.0           5.2          2.0  virginica
148           6.0          3.4           5.4          2.3  virginica
149           6.0          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [502]:
idx = np.random.randint(1,100,20)

In [504]:
df.petal_length[idx] = np.nan

In [505]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.0          3.5           1.4          0.2     setosa
1             NaN          3.0           1.4          0.2     setosa
2             5.0          3.2           1.3          0.2     setosa
3             5.0          3.1           1.5          0.2     setosa
4             5.0          3.6           NaN          0.2     setosa
..            ...          ...           ...          ...        ...
145           7.0          3.0           5.2          2.3  virginica
146           6.0          2.5           5.0          1.9  virginica
147           6.0          3.0           5.2          2.0  virginica
148           6.0          3.4           5.4          2.3  virginica
149           6.0          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [507]:
df.isnull().sum()

sepal_length    14
sepal_width      0
petal_length    19
petal_width      0
species          0
dtype: int64

In [509]:
#df.dropna()

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.0          3.5           1.4          0.2     setosa
2             5.0          3.2           1.3          0.2     setosa
3             5.0          3.1           1.5          0.2     setosa
5             5.0          3.9           1.7          0.4     setosa
8             4.0          2.9           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           7.0          3.0           5.2          2.3  virginica
146           6.0          2.5           5.0          1.9  virginica
147           6.0          3.0           5.2          2.0  virginica
148           6.0          3.4           5.4          2.3  virginica
149           6.0          3.0           5.1          1.8  virginica

[117 rows x 5 columns]

In [510]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.0          3.5           1.4          0.2     setosa
1             NaN          3.0           1.4          0.2     setosa
2             5.0          3.2           1.3          0.2     setosa
3             5.0          3.1           1.5          0.2     setosa
4             5.0          3.6           NaN          0.2     setosa
..            ...          ...           ...          ...        ...
145           7.0          3.0           5.2          2.3  virginica
146           6.0          2.5           5.0          1.9  virginica
147           6.0          3.0           5.2          2.0  virginica
148           6.0          3.4           5.4          2.3  virginica
149           6.0          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [512]:
df.fillna('this')

    sepal_length  sepal_width petal_length  petal_width    species
0            5.0          3.5          1.4          0.2     setosa
1           this          3.0          1.4          0.2     setosa
2            5.0          3.2          1.3          0.2     setosa
3            5.0          3.1          1.5          0.2     setosa
4            5.0          3.6         this          0.2     setosa
..           ...          ...          ...          ...        ...
145          7.0          3.0          5.2          2.3  virginica
146          6.0          2.5          5.0          1.9  virginica
147          6.0          3.0          5.2          2.0  virginica
148          6.0          3.4          5.4          2.3  virginica
149          6.0          3.0          5.1          1.8  virginica

[150 rows x 5 columns]

In [516]:
df.sepal_length.fillna(value='sanjay')[:50]

0        5.0
1     sanjay
2        5.0
3        5.0
4        5.0
5        5.0
6     sanjay
7        5.0
8        4.0
9        5.0
10       5.0
11       5.0
12       5.0
13       4.0
14    sanjay
15       6.0
16       5.0
17       5.0
18    sanjay
19       5.0
20       5.0
21       5.0
22       5.0
23       5.0
24       5.0
25       5.0
26       5.0
27       5.0
28    sanjay
29       5.0
30       5.0
31    sanjay
32       5.0
33       6.0
34       5.0
35    sanjay
36       6.0
37       5.0
38       4.0
39       5.0
40       5.0
41       4.0
42       4.0
43       5.0
44    sanjay
45       5.0
46       5.0
47       5.0
48       5.0
49       5.0
Name: sepal_length, dtype: object

In [521]:
round(df.sepal_length.mean(), 2)

5.88

In [524]:
df.sepal_length.fillna(value=round(df.sepal_length.mean(), 2), inplace=True)

In [527]:
df['sepal_length'][:50]

0     5.00
1     5.88
2     5.00
3     5.00
4     5.00
5     5.00
6     5.88
7     5.00
8     4.00
9     5.00
10    5.00
11    5.00
12    5.00
13    4.00
14    5.88
15    6.00
16    5.00
17    5.00
18    5.88
19    5.00
20    5.00
21    5.00
22    5.00
23    5.00
24    5.00
25    5.00
26    5.00
27    5.00
28    5.88
29    5.00
30    5.00
31    5.88
32    5.00
33    6.00
34    5.00
35    5.88
36    6.00
37    5.00
38    4.00
39    5.00
40    5.00
41    4.00
42    4.00
43    5.00
44    5.88
45    5.00
46    5.00
47    5.00
48    5.00
49    5.00
Name: sepal_length, dtype: float64

In [532]:
round(df.petal_length.mean(),2)

3.84

In [535]:
df.petal_length = df.petal_length.fillna(value=round(df.petal_length.mean(),2))

In [536]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0            5.00          3.5          1.40          0.2     setosa
1            5.88          3.0          1.40          0.2     setosa
2            5.00          3.2          1.30          0.2     setosa
3            5.00          3.1          1.50          0.2     setosa
4            5.00          3.6          3.84          0.2     setosa
..            ...          ...           ...          ...        ...
145          7.00          3.0          5.20          2.3  virginica
146          6.00          2.5          5.00          1.9  virginica
147          6.00          3.0          5.20          2.0  virginica
148          6.00          3.4          5.40          2.3  virginica
149          6.00          3.0          5.10          1.8  virginica

[150 rows x 5 columns]

In [538]:
df.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [539]:
# concat/ merge dataframes

In [545]:
new_df = pd.DataFrame(np.random.randint(0,7, (10,4)))

In [548]:
new_df['species']  = 'new-species14'

In [549]:
new_df

   0  1  2  3        species
0  5  4  4  0  new-species14
1  4  5  2  6  new-species14
2  6  2  1  4  new-species14
3  1  4  3  4  new-species14
4  1  4  4  5  new-species14
5  4  0  5  3  new-species14
6  2  3  1  6  new-species14
7  4  4  4  4  new-species14
8  1  4  0  6  new-species14
9  4  0  3  2  new-species14

In [550]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [552]:
new_df.columns = df.columns

In [553]:
new_df

   sepal_length  sepal_width  petal_length  petal_width        species
0             5            4             4            0  new-species14
1             4            5             2            6  new-species14
2             6            2             1            4  new-species14
3             1            4             3            4  new-species14
4             1            4             4            5  new-species14
5             4            0             5            3  new-species14
6             2            3             1            6  new-species14
7             4            4             4            4  new-species14
8             1            4             0            6  new-species14
9             4            0             3            2  new-species14

In [556]:
df1 = pd.concat((df,new_df))

In [557]:
df1.shape

(160, 5)

In [558]:
df1.head()

   sepal_length  sepal_width  petal_length  petal_width species
0          5.00          3.5          1.40          0.2  setosa
1          5.88          3.0          1.40          0.2  setosa
2          5.00          3.2          1.30          0.2  setosa
3          5.00          3.1          1.50          0.2  setosa
4          5.00          3.6          3.84          0.2  setosa

In [560]:
df2 = pd.concat((df,new_df), axis=1)

In [561]:
df2

,sepal_length,sepal_width,petal_length,petal_width,species,sepal_length,sepal_width,petal_length,petal_width,species
0,5.00,3.5,1.40,0.2,setosa,5.0,4.0,4.0,0.0,new-species14
1,5.88,3.0,1.40,0.2,setosa,4.0,5.0,2.0,6.0,new-species14
2,5.00,3.2,1.30,0.2,setosa,6.0,2.0,1.0,4.0,new-species14
3,5.00,3.1,1.50,0.2,setosa,1.0,4.0,3.0,4.0,new-species14
4,5.00,3.6,3.84,0.2,setosa,1.0,4.0,4.0,5.0,new-species14
...,...,...,...,...,...,...,...,...,...,...
145,7.00,3.0,5.20,2.3,virginica,NaN,NaN,NaN,NaN,NaN
146,6.00,2.5,5.00,1.9,virginica,NaN,NaN,NaN,NaN,NaN
147,6.00,3.0,5.20,2.0,virginica,NaN,NaN,NaN,NaN,NaN
148,6.00,3.4,5.40,2.3,virginica,NaN,NaN,NaN,NaN,NaN
149,6.00,3.0,5.10,1.8,virginica,NaN,NaN,NaN,NaN,NaN

In [562]:
df2.shape

(150, 10)

In [563]:
# merging dataframes

In [565]:
df1 = pd.DataFrame({
    'S_Name':['Mohit', 'Jatin', 'Prateek', 'Mohit'],
    'CGPA':[2,4,5,3]
})

In [566]:
df1

    S_Name  CGPA
0    Mohit     2
1    Jatin     4
2  Prateek     5
3    Mohit     3

In [567]:
df2 = pd.DataFrame({
    'T_Name':["Mohit",'Jatin' ,'Prateek', 'Mohit'],
    'CGPA':[3,6,8,9]
})

In [568]:
df2

    T_Name  CGPA
0    Mohit     3
1    Jatin     6
2  Prateek     8
3    Mohit     9

In [569]:
df1.merge(df2)

  S_Name  CGPA T_Name
0  Mohit     3  Mohit

In [570]:
df1.merge(df2, how='left')

    S_Name  CGPA T_Name
0    Mohit     2    NaN
1    Jatin     4    NaN
2  Prateek     5    NaN
3    Mohit     3  Mohit

In [571]:
df1.merge(df2, how='right')

  S_Name  CGPA   T_Name
0  Mohit     3    Mohit
1    NaN     6    Jatin
2    NaN     8  Prateek
3    NaN     9    Mohit

In [572]:
df1.merge(df2, how='cross')

     S_Name  CGPA_x   T_Name  CGPA_y
0     Mohit       2    Mohit       3
1     Mohit       2    Jatin       6
2     Mohit       2  Prateek       8
3     Mohit       2    Mohit       9
4     Jatin       4    Mohit       3
5     Jatin       4    Jatin       6
6     Jatin       4  Prateek       8
7     Jatin       4    Mohit       9
8   Prateek       5    Mohit       3
9   Prateek       5    Jatin       6
10  Prateek       5  Prateek       8
11  Prateek       5    Mohit       9
12    Mohit       3    Mohit       3
13    Mohit       3    Jatin       6
14    Mohit       3  Prateek       8
15    Mohit       3    Mohit       9

In [573]:
df1.merge(df2, how='outer', on='CGPA')

    S_Name  CGPA   T_Name
0    Mohit     2      NaN
1    Jatin     4      NaN
2  Prateek     5      NaN
3    Mohit     3    Mohit
4      NaN     6    Jatin
5      NaN     8  Prateek
6      NaN     9    Mohit

In [576]:
df.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [578]:
df.to_csv('my_15_data.csv', index=False)

In [580]:
modified_csv= pd.read_csv('my_15_data.csv')

In [581]:
modified_csv.head()

   sepal_length  sepal_width  petal_length  petal_width species
0          5.00          3.5          1.40          0.2  setosa
1          5.88          3.0          1.40          0.2  setosa
2          5.00          3.2          1.30          0.2  setosa
3          5.00          3.1          1.50          0.2  setosa
4          5.00          3.6          3.84          0.2  setosa

In [584]:
df.to_excel('my_15_excel.xlsx',sheet_name='sales_data' ,index=False)